; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
;  - remove the road predicate to allow fully connected graph
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (not (at ?v ?l2))
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=5, packages=12, locations=13, density=1.0, fully_connected=True, max_capacity=2, out_folder=./fully/training, instance_id=25, seed=66

(define (problem transport-25)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity v5 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l5)
    (at p2 l5)
    (at p3 l13)
    (at p4 l9)
    (at p5 l2)
    (at p6 l12)
    (at p7 l8)
    (at p8 l3)
    (at p9 l8)
    (at p10 l9)
    (at p11 l3)
    (at p12 l13)
    (at v1 l12)
    (at v2 l2)
    (at v3 l12)
    (at v4 l6)
    (at v5 l12)
    )
 (:goal  (and 
    (at p1 l3)
    (at p2 l7)
    (at p3 l12)
    (at p4 l12)
    (at p5 l8)
    (at p6 l11)
    (at p7 l9)
    (at p8 l1)
    (at p9 l9)
    (at p10 l2)
    (at p11 l7)
    (at p12 l3))))

; plan
1. (pick-up v2 l2 p5 c1 c2)
   deleted: (at p5 l2) (capacity v2 c2)
   added: (in p5 v2) (capacity v2 c1)
   goals met: 0 of 12
2. (drive v2 l2 l8)
   deleted: (at v2 l2)
   added: (at v2 l8)
   goals met: 0 of 12
3. (drop v2 l8 p5 c1 c2)
   deleted: (in p5 v2) (capacity v2 c1)
   added: (at p5 l8) (capacity v2 c2)
   goals met: 1 of 12
4. (drive v2 l8 l9)
   deleted: (at v2 l8)
   added: (at v2 l9)
   goals met: 1 of 12
5. (pick-up v2 l9 p10 c1 c2)
   deleted: (at p10 l9) (capacity v2 c2)
   added: (in p10 v2) (capacity v2 c1)
   goals met: 1 of 12
6. (drive v2 l9 l2)
   deleted: (at v2 l9)
   added: (at v2 l2)
   goals met: 1 of 12
7. (drop v2 l2 p10 c1 c2)
   deleted: (in p10 v2) (capacity v2 c1)
   added: (at p10 l2) (capacity v2 c2)
   goals met: 2 of 12
8. (pick-up v1 l12 p6 c0 c1)
   deleted: (at p6 l12) (capacity v1 c1)
   added: (in p6 v1) (capacity v1 c0)
   goals met: 2 of 12
9. (drive v4 l6 l1)
   deleted: (at v4 l6)
   added: (at v4 l1)
   goals met: 2 of 12
10. (drive v1 l12 l11)
   deleted: (at v1 l12)
   added: (at v1 l11)
   goals met: 2 of 12
11. (drop v1 l11 p6 c0 c1)
   deleted: (in p6 v1) (capacity v1 c0)
   added: (at p6 l11) (capacity v1 c1)
   goals met: 3 of 12
12. (drive v1 l11 l12)
   deleted: (at v1 l11)
   added: (at v1 l12)
   goals met: 3 of 12
13. (drive v4 l1 l3)
   deleted: (at v4 l1)
   added: (at v4 l3)
   goals met: 3 of 12
14. (pick-up v4 l3 p8 c0 c1)
   deleted: (at p8 l3) (capacity v4 c1)
   added: (in p8 v4) (capacity v4 c0)
   goals met: 3 of 12
15. (drive v4 l3 l1)
   deleted: (at v4 l3)
   added: (at v4 l1)
   goals met: 3 of 12
16. (drop v4 l1 p8 c0 c1)
   deleted: (in p8 v4) (capacity v4 c0)
   added: (at p8 l1) (capacity v4 c1)
   goals met: 4 of 12
17. (drive v1 l12 l13)
   deleted: (at v1 l12)
   added: (at v1 l13)
   goals met: 4 of 12
18. (pick-up v1 l13 p12 c0 c1)
   deleted: (at p12 l13) (capacity v1 c1)
   added: (in p12 v1) (capacity v1 c0)
   goals met: 4 of 12
19. (drive v4 l1 l12)
   deleted: (at v4 l1)
   added: (at v4 l12)
   goals met: 4 of 12
20. (drive v1 l13 l3)
   deleted: (at v1 l13)
   added: (at v1 l3)
   goals met: 4 of 12
21. (drive v4 l12 l3)
   deleted: (at v4 l12)
   added: (at v4 l3)
   goals met: 4 of 12
22. (drop v1 l3 p12 c0 c1)
   deleted: (in p12 v1) (capacity v1 c0)
   added: (at p12 l3) (capacity v1 c1)
   goals met: 5 of 12
23. (pick-up v4 l3 p11 c0 c1)
   deleted: (at p11 l3) (capacity v4 c1)
   added: (in p11 v4) (capacity v4 c0)
   goals met: 5 of 12
24. (drive v4 l3 l7)
   deleted: (at v4 l3)
   added: (at v4 l7)
   goals met: 5 of 12
25. (drop v4 l7 p11 c0 c1)
   deleted: (in p11 v4) (capacity v4 c0)
   added: (at p11 l7) (capacity v4 c1)
   goals met: 6 of 12
26. (drive v4 l7 l5)
   deleted: (at v4 l7)
   added: (at v4 l5)
   goals met: 6 of 12
27. (pick-up v4 l5 p2 c0 c1)
   deleted: (at p2 l5) (capacity v4 c1)
   added: (in p2 v4) (capacity v4 c0)
   goals met: 6 of 12
28. (drive v4 l5 l7)
   deleted: (at v4 l5)
   added: (at v4 l7)
   goals met: 6 of 12
29. (drop v4 l7 p2 c0 c1)
   deleted: (in p2 v4) (capacity v4 c0)
   added: (at p2 l7) (capacity v4 c1)
   goals met: 7 of 12
30. (drive v1 l3 l5)
   deleted: (at v1 l3)
   added: (at v1 l5)
   goals met: 7 of 12
31. (pick-up v1 l5 p1 c0 c1)
   deleted: (at p1 l5) (capacity v1 c1)
   added: (in p1 v1) (capacity v1 c0)
   goals met: 7 of 12
32. (drive v4 l7 l12)
   deleted: (at v4 l7)
   added: (at v4 l12)
   goals met: 7 of 12
33. (drive v1 l5 l3)
   deleted: (at v1 l5)
   added: (at v1 l3)
   goals met: 7 of 12
34. (drop v1 l3 p1 c0 c1)
   deleted: (in p1 v1) (capacity v1 c0)
   added: (at p1 l3) (capacity v1 c1)
   goals met: 8 of 12
35. (drive v1 l3 l8)
   deleted: (at v1 l3)
   added: (at v1 l8)
   goals met: 8 of 12
36. (drive v4 l12 l13)
   deleted: (at v4 l12)
   added: (at v4 l13)
   goals met: 8 of 12
37. (pick-up v4 l13 p3 c0 c1)
   deleted: (at p3 l13) (capacity v4 c1)
   added: (in p3 v4) (capacity v4 c0)
   goals met: 8 of 12
38. (drive v4 l13 l12)
   deleted: (at v4 l13)
   added: (at v4 l12)
   goals met: 8 of 12
39. (drop v4 l12 p3 c0 c1)
   deleted: (in p3 v4) (capacity v4 c0)
   added: (at p3 l12) (capacity v4 c1)
   goals met: 9 of 12
40. (drive v4 l12 l9)
   deleted: (at v4 l12)
   added: (at v4 l9)
   goals met: 9 of 12
41. (pick-up v4 l9 p4 c0 c1)
   deleted: (at p4 l9) (capacity v4 c1)
   added: (in p4 v4) (capacity v4 c0)
   goals met: 9 of 12
42. (drive v4 l9 l12)
   deleted: (at v4 l9)
   added: (at v4 l12)
   goals met: 9 of 12
43. (drop v4 l12 p4 c0 c1)
   deleted: (in p4 v4) (capacity v4 c0)
   added: (at p4 l12) (capacity v4 c1)
   goals met: 10 of 12
44. (pick-up v1 l8 p7 c0 c1)
   deleted: (at p7 l8) (capacity v1 c1)
   added: (in p7 v1) (capacity v1 c0)
   goals met: 10 of 12
45. (drive v1 l8 l9)
   deleted: (at v1 l8)
   added: (at v1 l9)
   goals met: 10 of 12
46. (drive v4 l12 l8)
   deleted: (at v4 l12)
   added: (at v4 l8)
   goals met: 10 of 12
47. (pick-up v4 l8 p9 c0 c1)
   deleted: (at p9 l8) (capacity v4 c1)
   added: (in p9 v4) (capacity v4 c0)
   goals met: 10 of 12
48. (drive v4 l8 l9)
   deleted: (at v4 l8)
   added: (at v4 l9)
   goals met: 10 of 12
49. (drop v4 l9 p9 c0 c1)
   deleted: (in p9 v4) (capacity v4 c0)
   added: (at p9 l9) (capacity v4 c1)
   goals met: 11 of 12
50. (drop v1 l9 p7 c0 c1)
   deleted: (in p7 v1) (capacity v1 c0)
   added: (at p7 l9) (capacity v1 c1)
   goals met: 12 of 12
